In [278]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [279]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [280]:
for i in range(0,int(df.size/5)):
    df['FlightNumber'].iloc[i+1]=df['FlightNumber'].iloc[i]+10
df

C:\Users\satya\anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [281]:
df2=df['FlightNumber'].astype('int',copy=True)

In [282]:
df['FlightNumber']=df2

df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [283]:
def test(x):
    a=''
    for i in x:
        if i != '_':
            a=a+i
        else:
            break
    return a

In [284]:
def test1(x):
    a=''
    for i in range(len(x)-1,0,-1):
        if x[i] != '_':
            a=a+x[i]
        else:
            break
    return a[::-1]

In [285]:
From=df['From_To'].apply(test)
dffrom=pd.DataFrame(data=From)
dffrom=dffrom.rename(columns={"From_To": "From"})

In [286]:
To=df['From_To'].apply(test1)
dfto=pd.DataFrame(data=To)
dfto=dfto.rename(columns={"From_To": "To"})

In [287]:
dffrom['To']=dfto['To']
dffrom_to=dffrom
dffrom_to

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [288]:
def cap(x):
    return x.capitalize()

In [289]:
dffromcap=dffrom_to['From'].apply(cap)
dffromcap=pd.DataFrame(dffromcap)

In [290]:
dftocap=dffrom_to['To'].apply(cap)
dftocap=pd.DataFrame(dftocap)

In [291]:
dffromcap['To']=dftocap['To']

In [292]:
dfcap=dffromcap
dfcap

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [293]:
df.drop(axis=1,columns=['From_To'],inplace=True)

In [294]:
df2=df.join(dfcap)

In [295]:
df2

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [296]:
df2['RecentDelays'][0]

[23, 47]

In [297]:
df2['delay_1']=pd.DataFrame(df['RecentDelays'].apply(getdelay))['RecentDelays']

In [298]:
df2['delay_2']=pd.DataFrame(df['RecentDelays'].apply(getdelay2))['RecentDelays']

In [299]:
df2['delay_3']=pd.DataFrame(df['RecentDelays'].apply(getdelay3))['RecentDelays']

In [300]:
def getdelay1(x):
    if len(x)==0:
        return 'NaN'
    else: 
        return x[0]

In [301]:
def getdelay2(x):
    if len(x)==1 or len(x)==0:
        return 'NaN'
    else: 
        return x[1]

In [302]:
def getdelay3(x):
    if len(x)==2 or len(x)==1 or len(x)==0:
        return 'NaN'
    else: 
        return x[2]

In [303]:
df2

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,NaN

In [306]:
df2.drop(axis=1,columns=['RecentDelays'],inplace=True)

In [310]:
df2

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23,47,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67,32,NaN